99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_raw_tx/esp32_mquickjs_wifi_raw_tx_session.c
#include "esp32_mquickjs_wifi_raw_tx_ap.h"
#include "esp32_mquickjs_wifi_raw_tx_session.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
#include "esp32_mquickjs_wifi_raw_tx_lane.h"
#include "esp32_mquickjs_wifi_radio.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_memory.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "freertos/semphr.h"
#include <stdatomic.h>
#include <string.h>

typedef esp32_mquickjs_wifi_raw_tx_session_t session_t;
typedef esp32_mquickjs_wifi_raw_tx_payload_t payload_t;
struct esp32_mquickjs_wifi_raw_tx_session {
    StaticSemaphore_t mutex_storage;
    SemaphoreHandle_t mutex;
    esp32_mquickjs_wifi_raw_tx_session_options_t options;
    esp32_mquickjs_wifi_raw_tx_queue_t queue;
    esp32_mquickjs_wifi_raw_tx_queue_slot_t *slots;
    /* Registry lock protects references; task mutex protects mutable records.
     * SDK work uses local copies while worker_busy excludes a second worker. */
    uint32_t references;
    bool cleanup_hold;
    atomic_bool close_requested, closed;
    bool open_complete, faulted, worker_busy, stop_pending, lane_acquired;
    int64_t next_service_us;
    esp_err_t error, cleanup_error;
    const char *stage, *cleanup_stage;
    uint8_t channel;
    esp32_mquickjs_wifi_radio_lease_t lease;
    esp32_mquickjs_wifi_raw_tx_ap_context_t ap;
    bool ap_physical_terminated;
    esp32_mquickjs_wifi_raw_tx_lane_token_t lane;
    esp32_mquickjs_wifi_raw_tx_token_t native_token;
    esp32_mquickjs_wifi_raw_tx_ticket_t ticket;
    uint32_t last_sequence;
    esp32_mquickjs_wifi_raw_tx_broker_status_t last_completion;
    uint8_t periodic_children;
    uint32_t next_result_identity;
    esp32_mquickjs_wifi_raw_tx_result_record_t *results[ESP32_MQUICKJS_WIFI_RAW_TX_MAX_RESULTS];
};
static portMUX_TYPE s_sessions_lock = portMUX_INITIALIZER_UNLOCKED;
static session_t *s_sessions[ESP32_MQUICKJS_WIFI_RAW_TX_MAX_SESSIONS];
static uint32_t s_next_session_generation = 1;

bool esp32_mquickjs_wifi_raw_tx_session_retain(session_t *session)
{
    if (session == NULL) return false;
    portENTER_CRITICAL(&s_sessions_lock);
    bool ok = session->references != 0U && session->references != UINT32_MAX;
    if (ok) ++session->references;
    portEXIT_CRITICAL(&s_sessions_lock);
    return ok;
}

void esp32_mquickjs_wifi_raw_tx_session_release(session_t *session)
{
    if (session == NULL) return;
    portENTER_CRITICAL(&s_sessions_lock);
    bool destroy = session->references == 1U && atomic_load_explicit(&session->closed, memory_order_acquire);
    if (session->references > 1U || destroy) --session->references;
    if (destroy) for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_SESSIONS; ++i)
        if (s_sessions[i] == session) s_sessions[i] = NULL;
    portEXIT_CRITICAL(&s_sessions_lock);
    if (!destroy) return;
    /* Every worker, snapshot and flush watcher owns a reference. Therefore the
     * final closed reference cannot race a queue/SDK operation or live watcher. */
    bool retired = esp32_mquickjs_wifi_raw_tx_queue_deinit(&session->queue);
    configASSERT(retired);
    vSemaphoreDelete(session->mutex);
    esp32_mquickjs_memory_payload_free(session->slots);
    esp32_mquickjs_memory_payload_free(session);
}

static size_t sessions_snapshot(session_t **output)
{
    size_t count = 0;
    portENTER_CRITICAL(&s_sessions_lock);
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_SESSIONS; ++i) {
        session_t *session = s_sessions[i];
        if (session == NULL || session->references == 0U || session->references == UINT32_MAX) continue;
        ++session->references;
        output[count++] = session;
    }
    portEXIT_CRITICAL(&s_sessions_lock);
    return count;
}

void esp32_mquickjs_wifi_raw_tx_session_request_close(session_t *session)
{
    if (session != NULL) atomic_store_explicit(&session->close_requested, true, memory_order_release);
}

void esp32_mquickjs_wifi_raw_tx_sessions_request_close(void)
{
    portENTER_CRITICAL(&s_sessions_lock);
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_SESSIONS; ++i)
        if (s_sessions[i] != NULL) atomic_store_explicit(&s_sessions[i]->close_requested, true, memory_order_release);
    portEXIT_CRITICAL(&s_sessions_lock);
}

bool esp32_mquickjs_wifi_raw_tx_sessions_drained(void)
{
    bool drained = true;
    portENTER_CRITICAL(&s_sessions_lock);
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_SESSIONS; ++i)
        if (s_sessions[i] != NULL && !atomic_load_explicit(&s_sessions[i]->closed, memory_order_acquire)) drained = false;
    portEXIT_CRITICAL(&s_sessions_lock);
    return drained;
}

void esp32_mquickjs_wifi_raw_tx_sessions_status(esp32_mquickjs_wifi_raw_tx_sessions_status_t *output)
{
    if (output == NULL) return;
    esp32_mquickjs_wifi_raw_tx_sessions_status_t status = {0};
    session_t *sessions[ESP32_MQUICKJS_WIFI_RAW_TX_MAX_SESSIONS];
    size_t count = sessions_snapshot(sessions);
    for (size_t i = 0; i < count; ++i) {
        session_t *session = sessions[i];
        xSemaphoreTake(session->mutex, portMAX_DELAY);
        bool closed = atomic_load_explicit(&session->closed, memory_order_acquire);
        if (closed) ++status.closed; else ++status.live;
        if (!closed && atomic_load_explicit(&session->close_requested, memory_order_acquire)) ++status.closing;
        if (session->faulted) ++status.faulted;
        for (unsigned j = 0; j < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_RESULTS; ++j)
            if (session->results[j] != NULL) ++status.pending_results;
        for (unsigned j = 0; j < ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_FLUSHES; ++j)
            if (session->queue.flushes[j].identity != 0U) ++status.pending_flushes;
        if (status.error_generation == 0U && (session->error != ESP_OK || session->cleanup_error != ESP_OK)) {
            status.error_generation = session->queue.generation;
            status.error = session->error; status.stage = session->stage;
            status.cleanup_error = session->cleanup_error; status.cleanup_stage = session->cleanup_stage;
        }
        xSemaphoreGive(session->mutex);
        esp32_mquickjs_wifi_raw_tx_session_release(session);
    }
    *output = status;
}

esp_err_t esp32_mquickjs_wifi_raw_tx_session_new(
    const esp32_mquickjs_wifi_raw_tx_session_options_t *options, session_t **output)
{
    if (options == NULL || output == NULL || *output != NULL || options->capacity == 0U ||
        options->capacity > ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_PACKETS ||
        (options->interface != ESP32_MQUICKJS_WIFI_RAW_TX_STATION && options->interface != ESP32_MQUICKJS_WIFI_RAW_TX_ACCESS_POINT) ||
        (options->overflow != ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_REJECT_NEWEST &&
         options->overflow != ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_DROP_OLDEST_BATCH)) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (options->interface == ESP32_MQUICKJS_WIFI_RAW_TX_ACCESS_POINT) return ESP_ERR_NOT_SUPPORTED;
#endif
    if (options->rate_set) {
        if (!esp32_mquickjs_wifi_tx_rate_valid(&options->rate)) return ESP_ERR_INVALID_ARG;
    }
    if (options->channel > 14U) {
#if CONFIG_SOC_WIFI_SUPPORT_5G
        if (esp32_mquickjs_wifi_radio_5ghz_channel_bit(options->channel) == 0U) return ESP_ERR_INVALID_ARG;
#else
        return ESP_ERR_INVALID_ARG;
#endif
    }
    session_t *session = esp32_mquickjs_memory_wireless_calloc("wifi.raw-tx", 1, sizeof(*session), ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (session == NULL) return ESP_ERR_NO_MEM;
    session->slots = esp32_mquickjs_memory_wireless_calloc("wifi.raw-tx", options->capacity, sizeof(*session->slots), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_QUEUE);
    if (session->slots == NULL) { esp32_mquickjs_memory_payload_free(session); return ESP_ERR_NO_MEM; }
    session->mutex = xSemaphoreCreateMutexStatic(&session->mutex_storage);
    if (session->mutex == NULL) { esp32_mquickjs_memory_payload_free(session->slots); esp32_mquickjs_memory_payload_free(session); return ESP_ERR_NO_MEM; }
    session->options = *options;
    session->references = 2; /* caller + native cleanup */
    session->cleanup_hold = true;
    session->next_result_identity = 1;
    atomic_init(&session->close_requested, false);
    atomic_init(&session->closed, false);
    /* Burn identity before initialization; never publish partially initialized
     * control to the registry, and never recycle an identity after any failure. */
    portENTER_CRITICAL(&s_sessions_lock);
    uint32_t generation = s_next_session_generation;
    if (generation != 0U) s_next_session_generation = generation == UINT32_MAX ? 0U : generation + 1U;
    portEXIT_CRITICAL(&s_sessions_lock);
    bool initialized = generation != 0U && esp32_mquickjs_wifi_raw_tx_queue_init(
        &session->queue, session->slots, options->capacity, generation);
    bool published = false;
    if (initialized) {
        portENTER_CRITICAL(&s_sessions_lock);
        for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_SESSIONS; ++i) if (s_sessions[i] == NULL) {
            s_sessions[i] = session; published = true; break;
        }
        portEXIT_CRITICAL(&s_sessions_lock);
    }
    if (!published) {
        vSemaphoreDelete(session->mutex);
        esp32_mquickjs_memory_payload_free(session->slots); esp32_mquickjs_memory_payload_free(session);
        return ESP_ERR_INVALID_STATE;
    }
    *output = session;
    return ESP_OK;
}

bool esp32_mquickjs_wifi_raw_tx_session_status(session_t *session,
    esp32_mquickjs_wifi_raw_tx_session_status_t *output)
{
    if (session == NULL || output == NULL) return false;
    if (xSemaphoreTake(session->mutex, portMAX_DELAY) != pdTRUE) return false;
    *output = (esp32_mquickjs_wifi_raw_tx_session_status_t){
        .generation = session->queue.generation, .radio_generation = session->lease.generation,
        .active_sequence = session->queue.active != ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_NONE
            ? session->slots[session->queue.active].sequence : 0U,
        .lane_identity = session->lane.identity,
        .channel = session->channel, .queued = session->queue.queued, .capacity = session->queue.capacity,
        .periodic_children = session->periodic_children,
        .open_complete = session->open_complete, .faulted = session->faulted, .worker_busy = session->worker_busy,
        .close_requested = atomic_load_explicit(&session->close_requested, memory_order_acquire),
        .closed = atomic_load_explicit(&session->closed, memory_order_acquire),
        .error = session->error, .stage = session->stage, .cleanup_error = session->cleanup_error,
        .cleanup_stage = session->cleanup_stage, .totals = session->queue.totals,
        .last_sequence = session->last_sequence, .last_completion = session->last_completion,
    };
    xSemaphoreGive(session->mutex);
    return true;
}

/* These result helpers run only under the Session mutex. A record pointer is
 * never retained outside that mutex, so unregister may immediately return its
 * storage to a finished Future even while the SDK still owns the packet. */
static void session_result_publish(session_t *session, uint32_t sequence,
    esp32_mquickjs_wifi_raw_tx_result_kind_t kind, esp_err_t error, const char *stage,
    uint8_t channel, const esp32_mquickjs_wifi_raw_tx_broker_status_t *native)
{
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_RESULTS; ++i) {
        esp32_mquickjs_wifi_raw_tx_result_record_t *record = session->results[i];
        if (record == NULL || record->result.sequence != sequence ||
            (record->result.kind != ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_PENDING &&
             !(record->result.kind == ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_UNCERTAIN &&
               kind == ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_TERMINATED && native != NULL && native->native_terminated))) continue;
        record->result.kind = kind; record->result.error = error; record->result.stage = stage;
        record->result.channel = channel;
        if (native != NULL) record->result.native = *native;
        record->payload = NULL;
    }
}

static void session_results_drop(session_t *session, const payload_t *removed, uint16_t count, const char *stage)
{
    for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_RESULTS; ++i) {
        esp32_mquickjs_wifi_raw_tx_result_record_t *record = session->results[i];
        if (record == NULL || record->result.kind != ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_PENDING) continue;
        for (unsigned j = 0; j < count; ++j) if (record->payload == removed[j].data) {
            session_result_publish(session, record->result.sequence, ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_DROPPED,
                ESP_ERR_INVALID_STATE, stage, session->channel, NULL);
            break;
        }
    }
}

static bool session_validate_frames(session_t *session, const payload_t *frames, uint16_t count,
    esp32_mquickjs_wifi_raw_tx_validation_t *validation)
{
    if (session == NULL || frames == NULL || count == 0U || count > session->options.capacity || validation == NULL)
        return false;
    esp32_mquickjs_wifi_raw_tx_validation_policy_t policy = {
        .interface = session->options.interface, .driver_sequence = session->options.driver_sequence};
    for (unsigned i = 0; i < count; ++i) {
        esp32_mquickjs_wifi_raw_tx_validated_frame_t frame;
        *validation = esp32_mquickjs_wifi_raw_tx_validate(frames[i].data, frames[i].length, &policy, &frame);
        if (*validation != ESP32_MQUICKJS_WIFI_RAW_TX_VALID) return false;
    }
    return true;
}

static esp32_mquickjs_wifi_raw_tx_queue_result_t session_admit_locked(session_t *session,
    payload_t *frames, uint16_t count, payload_t *removed, uint16_t removed_capacity,
    esp32_mquickjs_wifi_raw_tx_admission_t *admission)
{
    esp32_mquickjs_wifi_raw_tx_queue_result_t result = ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_CLOSED;
    if (session->open_complete && !session->faulted &&
        !atomic_load_explicit(&session->close_requested, memory_order_acquire)) {
        result = esp32_mquickjs_wifi_raw_tx_queue_admit(&session->queue, frames, count,
            session->options.overflow, removed, removed_capacity, admission);
        if (result == ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_OK) {
            session_results_drop(session, removed, admission->evicted_packets, "queue-overflow");
            session->next_service_us = 0;
        }
    }
    return result;
}

esp32_mquickjs_wifi_raw_tx_queue_result_t esp32_mquickjs_wifi_raw_tx_session_admit(
    session_t *session, payload_t *frames, uint16_t count, payload_t *removed, uint16_t removed_capacity,
    esp32_mquickjs_wifi_raw_tx_admission_t *admission, esp32_mquickjs_wifi_raw_tx_validation_t *validation)
{
    if (!session_validate_frames(session, frames, count, validation) ||
        xSemaphoreTake(session->mutex, portMAX_DELAY) != pdTRUE) return ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_INVALID;
    esp32_mquickjs_wifi_raw_tx_queue_result_t result = session_admit_locked(session, frames, count, removed, removed_capacity, admission);
    xSemaphoreGive(session->mutex);
    return result;
}

static esp32_mquickjs_wifi_raw_tx_queue_result_t session_admit_result(
    session_t *session, payload_t *frame, payload_t *removed, uint16_t removed_capacity,
    esp32_mquickjs_wifi_raw_tx_admission_t *admission, esp32_mquickjs_wifi_raw_tx_validation_t *validation,
    esp32_mquickjs_wifi_raw_tx_result_record_t *record, esp32_mquickjs_wifi_raw_tx_result_token_t *token, bool idle_only)
{
    if (record == NULL || token == NULL || record->registered || record->identity != 0U ||
        token->generation != 0U || token->identity != 0U || token->index != 0U ||
        !session_validate_frames(session, frame, 1, validation)) return ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_INVALID;
    if (!esp32_mquickjs_wifi_raw_tx_session_retain(session)) return ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_EXHAUSTED;
    esp32_mquickjs_wifi_raw_tx_queue_result_t result = ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_INVALID;
    if (xSemaphoreTake(session->mutex, portMAX_DELAY) == pdTRUE) {
        unsigned index = 0;
        while (index < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_RESULTS && session->results[index] != NULL) ++index;
        if (session->next_result_identity == 0U) result = ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_EXHAUSTED;
        else if (index == ESP32_MQUICKJS_WIFI_RAW_TX_MAX_RESULTS ||
            (idle_only && (session->queue.queued != 0U ||
                session->queue.active != ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_NONE || session->worker_busy)))
            result = ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_FULL;
        else {
            const uint8_t *payload = frame->data;
            result = session_admit_locked(session, frame, 1, removed, removed_capacity, admission);
            if (result == ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_OK) {
                uint32_t identity = session->next_result_identity;
                session->next_result_identity = identity == UINT32_MAX ? 0U : identity + 1U;
                *record = (esp32_mquickjs_wifi_raw_tx_result_record_t){.registered = true, .identity = identity,
                    .payload = payload, .result = {.generation = session->queue.generation,
                        .sequence = admission->first_sequence, .kind = ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_PENDING}};
                session->results[index] = record;
                *token = (esp32_mquickjs_wifi_raw_tx_result_token_t){session->queue.generation, identity, (uint8_t)index};
            }
        }
        xSemaphoreGive(session->mutex);
    }
    if (result != ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_OK) esp32_mquickjs_wifi_raw_tx_session_release(session);
    return result;
}

esp32_mquickjs_wifi_raw_tx_queue_result_t esp32_mquickjs_wifi_raw_tx_session_admit_result(
    session_t *session, payload_t *frame, payload_t *removed, uint16_t removed_capacity,
    esp32_mquickjs_wifi_raw_tx_admission_t *admission, esp32_mquickjs_wifi_raw_tx_validation_t *validation,
    esp32_mquickjs_wifi_raw_tx_result_record_t *record, esp32_mquickjs_wifi_raw_tx_result_token_t *token)
{
    return session_admit_result(session, frame, removed, removed_capacity, admission, validation, record, token, false);
}

esp32_mquickjs_wifi_raw_tx_queue_result_t esp32_mquickjs_wifi_raw_tx_session_admit_periodic(
    session_t *session, payload_t *frame, esp32_mquickjs_wifi_raw_tx_admission_t *admission,
    esp32_mquickjs_wifi_raw_tx_validation_t *validation, esp32_mquickjs_wifi_raw_tx_result_record_t *record,
    esp32_mquickjs_wifi_raw_tx_result_token_t *token)
{
    payload_t removed[ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_PACKETS] = {0};
    return session_admit_result(session, frame, removed, ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_PACKETS,
        admission, validation, record, token, true);
}

bool esp32_mquickjs_wifi_raw_tx_session_periodic_acquire(session_t *session, const payload_t *frame)
{
    esp32_mquickjs_wifi_raw_tx_validation_t validation;
    if (!session_validate_frames(session, frame, 1, &validation)) return false;
    if (!esp32_mquickjs_wifi_raw_tx_session_retain(session)) return false;
    xSemaphoreTake(session->mutex, portMAX_DELAY);
    bool ok = session->open_complete && !session->faulted && session->periodic_children < 8U &&
        !atomic_load_explicit(&session->close_requested, memory_order_acquire);
    if (ok) ++session->periodic_children;
    xSemaphoreGive(session->mutex);
    if (!ok) esp32_mquickjs_wifi_raw_tx_session_release(session);
    return ok;
}

void esp32_mquickjs_wifi_raw_tx_session_periodic_release(session_t *session)
{
    xSemaphoreTake(session->mutex, portMAX_DELAY);
    configASSERT(session->periodic_children != 0U);
    --session->periodic_children;
    xSemaphoreGive(session->mutex);
    esp32_mquickjs_wifi_raw_tx_session_release(session);
}

