99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_raw_tx/esp32_mquickjs_wifi_raw_tx_session.c
static esp32_mquickjs_wifi_raw_tx_result_record_t *session_result_exact(session_t *session,
    const esp32_mquickjs_wifi_raw_tx_result_token_t *token)
{
    if (token == NULL || token->generation != session->queue.generation || token->identity == 0U ||
        token->index >= ESP32_MQUICKJS_WIFI_RAW_TX_MAX_RESULTS) return NULL;
    esp32_mquickjs_wifi_raw_tx_result_record_t *record = session->results[token->index];
    return record != NULL && record->registered && record->identity == token->identity ? record : NULL;
}

bool esp32_mquickjs_wifi_raw_tx_session_result_status(session_t *session,
    const esp32_mquickjs_wifi_raw_tx_result_token_t *token, esp32_mquickjs_wifi_raw_tx_result_t *output)
{
    if (session == NULL || output == NULL || xSemaphoreTake(session->mutex, portMAX_DELAY) != pdTRUE) return false;
    esp32_mquickjs_wifi_raw_tx_result_record_t *record = session_result_exact(session, token);
    if (record != NULL) *output = record->result;
    xSemaphoreGive(session->mutex);
    return record != NULL;
}

bool esp32_mquickjs_wifi_raw_tx_session_result_release(session_t *session,
    esp32_mquickjs_wifi_raw_tx_result_token_t *token)
{
    if (session == NULL || xSemaphoreTake(session->mutex, portMAX_DELAY) != pdTRUE) return false;
    esp32_mquickjs_wifi_raw_tx_result_record_t *record = session_result_exact(session, token);
    if (record != NULL) {
        session->results[token->index] = NULL;
        memset(record, 0, sizeof(*record));
        *token = (esp32_mquickjs_wifi_raw_tx_result_token_t){0};
    }
    xSemaphoreGive(session->mutex);
    if (record != NULL) esp32_mquickjs_wifi_raw_tx_session_release(session);
    return record != NULL;
}

esp32_mquickjs_wifi_raw_tx_queue_result_t esp32_mquickjs_wifi_raw_tx_session_flush_begin(
    session_t *session, esp32_mquickjs_wifi_raw_tx_flush_token_t *token)
{
    if (!esp32_mquickjs_wifi_raw_tx_session_retain(session)) return ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_EXHAUSTED;
    if (xSemaphoreTake(session->mutex, portMAX_DELAY) != pdTRUE) {
        esp32_mquickjs_wifi_raw_tx_session_release(session); return ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_INVALID;
    }
    esp32_mquickjs_wifi_raw_tx_queue_result_t result = esp32_mquickjs_wifi_raw_tx_queue_flush_begin(&session->queue, token);
    xSemaphoreGive(session->mutex);
    if (result != ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_OK) esp32_mquickjs_wifi_raw_tx_session_release(session);
    return result;
}

bool esp32_mquickjs_wifi_raw_tx_session_flush_status(session_t *session,
    const esp32_mquickjs_wifi_raw_tx_flush_token_t *token, esp32_mquickjs_wifi_raw_tx_flush_status_t *output)
{
    if (session == NULL || xSemaphoreTake(session->mutex, portMAX_DELAY) != pdTRUE) return false;
    bool ok = esp32_mquickjs_wifi_raw_tx_queue_flush_status(&session->queue, token, output);
    xSemaphoreGive(session->mutex);
    return ok;
}

bool esp32_mquickjs_wifi_raw_tx_session_flush_release(session_t *session,
    esp32_mquickjs_wifi_raw_tx_flush_token_t *token)
{
    if (session == NULL || xSemaphoreTake(session->mutex, portMAX_DELAY) != pdTRUE) return false;
    bool ok = esp32_mquickjs_wifi_raw_tx_queue_flush_release(&session->queue, token);
    xSemaphoreGive(session->mutex);
    if (ok) esp32_mquickjs_wifi_raw_tx_session_release(session);
    return ok;
}

/* Task mutex held, no SDK work or freeing. First operational error survives
 * later cleanup retries; cleanup errors have their own diagnostic suffix. */
static void session_fault(session_t *session, esp_err_t error, const char *stage)
{
    if (!session->faulted) { session->error = error; session->stage = stage; }
    session->faulted = true;
    atomic_store_explicit(&session->close_requested, true, memory_order_release);
}

static void session_drop_queued(session_t *session)
{
    payload_t removed[ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_PACKETS] = {0};
    uint16_t count = 0;
    xSemaphoreTake(session->mutex, portMAX_DELAY);
    bool ok = esp32_mquickjs_wifi_raw_tx_queue_close(&session->queue, removed, session->options.capacity, &count);
    configASSERT(ok);
    session_results_drop(session, removed, count, "session-close");
    xSemaphoreGive(session->mutex);
    for (unsigned i = 0; i < count; ++i) esp32_mquickjs_memory_payload_free(removed[i].data);
}

static void session_worker(void *opaque)
{
    session_t *session = opaque;
    xSemaphoreTake(session->mutex, portMAX_DELAY);
    esp32_mquickjs_wifi_radio_lease_t lease = session->lease;
    esp32_mquickjs_wifi_raw_tx_lane_token_t lane = session->lane;
    esp32_mquickjs_wifi_raw_tx_token_t token = session->native_token;
    esp32_mquickjs_wifi_raw_tx_ticket_t ticket = session->ticket;
    bool lane_acquired = session->lane_acquired, stop_pending = session->stop_pending;
    bool ap_physical_terminated = session->ap_physical_terminated;
    bool opening = !session->open_complete, work = opening || session->queue.queued != 0U;
    uint8_t channel = session->channel;
    xSemaphoreGive(session->mutex);
    esp_err_t error = ESP_OK, cleanup_error = ESP_OK;
    const char *stage = NULL, *cleanup_stage = NULL;
    bool close_requested = atomic_load_explicit(&session->close_requested, memory_order_acquire);
    if (close_requested) session_drop_queued(session);
    if (work && !close_requested && lane.identity == 0U) {
        esp32_mquickjs_wifi_raw_tx_lane_result_t result = esp32_mquickjs_wifi_raw_tx_lane_request(&lane);
        if (result == ESP32_MQUICKJS_WIFI_RAW_TX_LANE_FULL) goto publish;
        if (result != ESP32_MQUICKJS_WIFI_RAW_TX_LANE_OK) {
            error = ESP_ERR_INVALID_STATE; stage = "lane-request"; goto fault;
        }
    }
    if (lane.identity != 0U && !lane_acquired && !close_requested)
        lane_acquired = esp32_mquickjs_wifi_raw_tx_lane_acquire(&lane);
    if (opening && !close_requested && lane_acquired) {
        /* Only the runtime service may prepare/retire AP helper globals. */
        if (session->options.rate_set && session->options.interface == ESP32_MQUICKJS_WIFI_RAW_TX_ACCESS_POINT)
            goto publish;
        error = esp32_mquickjs_wifi_radio_raw_tx_acquire(session->options.interface,
            session->options.channel, session->options.rate_set ? &session->options.rate : NULL, &lease, &channel);
        if (error != ESP_OK) { stage = "radio-open"; goto fault; }
        opening = false;
    }
    close_requested = atomic_load_explicit(&session->close_requested, memory_order_acquire);
    if (!opening && lane_acquired && token.identity == 0U && !close_requested) {
        payload_t borrowed = {0};
        xSemaphoreTake(session->mutex, portMAX_DELAY);
        bool take = !atomic_load_explicit(&session->close_requested, memory_order_acquire) &&
            esp32_mquickjs_wifi_raw_tx_queue_take(&session->queue, &ticket, &borrowed);
        xSemaphoreGive(session->mutex);
        if (take) {
            esp32_mquickjs_wifi_raw_tx_validation_t validation;
            if (atomic_load_explicit(&session->close_requested, memory_order_acquire)) {
                /* No SDK submit happened: this active payload is safe to abort. */
                payload_t retired = {0};
                xSemaphoreTake(session->mutex, portMAX_DELAY);
                uint32_t sequence = ticket.sequence;
                bool ok = esp32_mquickjs_wifi_raw_tx_queue_finish(&session->queue, &ticket,
                    ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_ABORTED, &retired);
                configASSERT(ok);
                if (ok) session_result_publish(session, sequence, ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_ABORTED,
                    ESP_ERR_INVALID_STATE, "close-before-submit", channel, NULL);
                xSemaphoreGive(session->mutex);
                esp32_mquickjs_memory_payload_free(retired.data);
            } else {
                error = esp32_mquickjs_wifi_radio_raw_tx_submit(&lease, session->options.interface,
                    session->options.driver_sequence, borrowed.data, borrowed.length, &token, &validation, &channel);
                xSemaphoreTake(session->mutex, portMAX_DELAY);
                if (error == ESP_OK) {
                    bool ok = token.identity != 0U && esp32_mquickjs_wifi_raw_tx_queue_accept(&session->queue, &ticket);
                    configASSERT(ok);
                    if (ok) for (unsigned i = 0; i < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_RESULTS; ++i) {
                        esp32_mquickjs_wifi_raw_tx_result_record_t *record = session->results[i];
                        if (record != NULL && record->result.sequence == ticket.sequence)
                            record->result.driver_submitted = true;
                    }
                }
                xSemaphoreGive(session->mutex);
                if (error != ESP_OK) {
                    if (token.identity == 0U) {
                        payload_t retired = {0};
                        xSemaphoreTake(session->mutex, portMAX_DELAY);
                        uint32_t sequence = ticket.sequence;
                        bool ok = esp32_mquickjs_wifi_raw_tx_queue_finish(&session->queue, &ticket,
                            ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_REJECTED, &retired);
                        configASSERT(ok);
                        session_fault(session, error, "submit");
                        if (ok) session_result_publish(session, sequence, ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_REJECTED,
                            error, "submit", channel, NULL);
                        xSemaphoreGive(session->mutex);
                        esp32_mquickjs_memory_payload_free(retired.data);
                    }
                    stage = "submit"; goto fault;
                }
            }
        }
    }
    if (token.identity != 0U) {
        esp32_mquickjs_wifi_raw_tx_broker_status_t native;
        esp32_mquickjs_wifi_raw_tx_broker_status(&native);
        if (native.token.identity != token.identity || native.token.generation != token.generation ||
            native.token.radio_lease_identity != token.radio_lease_identity ||
            (native.correlation_fault && !native.native_terminated)) {
            error = ESP_ERR_INVALID_STATE; stage = "completion-identity-correlation"; goto fault;
        }
        /* Retire may race a callback after the snapshot. Only attempt it when
         * this exact snapshot already contains completion; otherwise a newly
         * completed operation could be retired with an older unknown result. */
        if ((!native.driver_completed && !native.native_terminated) || native.callbacks_active != 0U) goto cleanup;
        if (!esp32_mquickjs_wifi_radio_raw_tx_retire(&lease, &token)) goto cleanup;
        payload_t retired = {0};
        esp32_mquickjs_wifi_raw_tx_queue_outcome_t outcome = native.native_terminated
            ? ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_ABORTED : native.completion.status == ESP32_MQUICKJS_WIFI_RAW_TX_DRIVER_SUCCESS
            ? ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_SUCCESS : native.completion.status == ESP32_MQUICKJS_WIFI_RAW_TX_DRIVER_FAILED
            ? ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_FAILED : ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_UNKNOWN;
        xSemaphoreTake(session->mutex, portMAX_DELAY);
        session->last_sequence = ticket.sequence;
        session->last_completion = native;
        bool ok = esp32_mquickjs_wifi_raw_tx_queue_finish(&session->queue, &ticket, outcome, &retired);
        configASSERT(ok);
        if (native.native_terminated) {
            ap_physical_terminated = true;
            esp_err_t terminated_error = native.submit_error != ESP_OK ? native.submit_error : ESP_ERR_INVALID_STATE;
            session_fault(session, terminated_error, "native-terminated");
            if (ok) session_result_publish(session, session->last_sequence, ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_TERMINATED,
                terminated_error, "native-terminated", channel, &native);
        } else if (ok) session_result_publish(session, session->last_sequence, ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_COMPLETED,
            ESP_OK, NULL, channel, &native);
        xSemaphoreGive(session->mutex);
        esp32_mquickjs_memory_payload_free(retired.data);
    }
    goto cleanup;
fault:
    xSemaphoreTake(session->mutex, portMAX_DELAY);
    session_fault(session, error, stage);
    xSemaphoreGive(session->mutex);
    if (ticket.sequence != 0U && token.identity != 0U) {
        esp32_mquickjs_wifi_raw_tx_broker_status_t native;
        esp32_mquickjs_wifi_raw_tx_broker_status(&native);
        if (native.token.identity != token.identity || native.token.generation != token.generation ||
            native.token.radio_lease_identity != token.radio_lease_identity) {
            native = (esp32_mquickjs_wifi_raw_tx_broker_status_t){.token = token};
        }
        xSemaphoreTake(session->mutex, portMAX_DELAY);
        session_result_publish(session, ticket.sequence, ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_UNCERTAIN,
            error, stage, channel, &native);
        xSemaphoreGive(session->mutex);
    }
cleanup:
    close_requested = atomic_load_explicit(&session->close_requested, memory_order_acquire);
    if (close_requested) {
        session_drop_queued(session);
        if (token.identity != 0U) {
            (void)esp32_mquickjs_wifi_raw_tx_broker_abandon(&token);
            cleanup_error = ESP_ERR_INVALID_STATE; cleanup_stage = "native-completion";
        } else if (session->ap.owned && !ap_physical_terminated) {
            stop_pending = true; /* Runtime exchanges rate owner for helper cleanup token. */
            cleanup_error = session->cleanup_error;
            cleanup_stage = session->cleanup_stage;
        } else if (lease.acquired || stop_pending) {
            cleanup_error = esp32_mquickjs_wifi_radio_release_and_stop_idle(&lease);
            if (lease.acquired && cleanup_error == ESP_OK) cleanup_error = ESP_ERR_INVALID_STATE;
            stop_pending = cleanup_error != ESP_OK;
            if (stop_pending) cleanup_stage = "radio-release-stop";
        }
    }
    /* A rate Session owns the interface exclusively until stopped restoration.
     * Keep its arbiter grant even while idle; failed close must not reuse it. */
    if (token.identity == 0U && !stop_pending && !session->ap.owned && lane.identity != 0U &&
        (!session->options.rate_set || close_requested)) {
        bool released = lane_acquired ? esp32_mquickjs_wifi_raw_tx_lane_release(&lane) :
            close_requested ? esp32_mquickjs_wifi_raw_tx_lane_withdraw(&lane) : false;
        if (released) lane_acquired = false;
        else if (lane_acquired || close_requested) {
            cleanup_error = ESP_ERR_INVALID_STATE; cleanup_stage = "lane-release";
        }
    }
publish:
    xSemaphoreTake(session->mutex, portMAX_DELAY);
    session->lease = lease; session->lane = lane; session->native_token = token; session->ticket = ticket;
    session->channel = channel; session->lane_acquired = lane_acquired; session->stop_pending = stop_pending;
    session->open_complete = !opening;
    session->ap_physical_terminated = ap_physical_terminated;
    session->cleanup_error = cleanup_error; session->cleanup_stage = cleanup_stage;
    bool drop_hold = false;
    if (atomic_load_explicit(&session->close_requested, memory_order_acquire) && session->queue.closed &&
        token.identity == 0U && ticket.sequence == 0U && !lease.acquired && lane.identity == 0U &&
        !stop_pending && !session->ap.owned && cleanup_error == ESP_OK && session->periodic_children == 0U) {
        atomic_store_explicit(&session->closed, true, memory_order_release);
        drop_hold = session->cleanup_hold; session->cleanup_hold = false;
    }
    session->next_service_us = esp_timer_get_time() + (cleanup_error != ESP_OK ? 100000 : 1000);
    session->worker_busy = false;
    xSemaphoreGive(session->mutex);
    if (drop_hold) esp32_mquickjs_wifi_raw_tx_session_release(session);
    esp32_mquickjs_wifi_raw_tx_session_release(session); /* worker reference, final access */
}

