99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_raw_tx/esp32_mquickjs_wifi_raw_tx_session.c
/* This entry is called only by the runtime poller/teardown. Ordinary service is
 * also called from a periodic background worker and must never touch AP globals. */
bool esp32_mquickjs_wifi_raw_tx_sessions_runtime_service(void)
{
    session_t *sessions[ESP32_MQUICKJS_WIFI_RAW_TX_MAX_SESSIONS];
    size_t count = sessions_snapshot(sessions);
    bool handled = false;
    int64_t now = esp_timer_get_time();
    for (size_t i = 0; i < count; ++i) {
        session_t *session = sessions[i];
        bool run = false, closing = false;
        esp32_mquickjs_wifi_raw_tx_ap_context_t ap = {0};
        esp32_mquickjs_wifi_radio_lease_t lease = {0};
        bool physically_terminated = false;
        uint8_t channel = 0;
        if (xSemaphoreTake(session->mutex, 0) == pdTRUE) {
            closing = atomic_load_explicit(&session->close_requested, memory_order_acquire);
            bool opening = !closing && !session->open_complete && session->lane_acquired;
            bool cleanup = closing && session->ap.owned && session->native_token.identity == 0U &&
                session->ticket.sequence == 0U && (!session->ap_physical_terminated || !session->lease.acquired);
            run = session->options.rate_set && session->options.interface == ESP32_MQUICKJS_WIFI_RAW_TX_ACCESS_POINT &&
                !session->worker_busy && !atomic_load_explicit(&session->closed, memory_order_acquire) &&
                now >= session->next_service_us && (opening || cleanup);
            if (run) {
                session->worker_busy = true;
                ap = session->ap; lease = session->lease; channel = session->channel;
                physically_terminated = session->ap_physical_terminated;
            }
            xSemaphoreGive(session->mutex);
        }
        if (run) {
            const char *stage = NULL;
            esp_err_t err = closing
                ? esp32_mquickjs_wifi_ap_close_raw_tx_rate(&ap, &lease, physically_terminated, &stage)
                : esp32_mquickjs_wifi_ap_open_raw_tx_rate(&ap, &session->options.rate,
                    session->options.channel, &lease, &channel, &stage);
            xSemaphoreTake(session->mutex, portMAX_DELAY);
            session->ap = ap; session->lease = lease; session->channel = channel;
            if (closing) {
                session->cleanup_error = err; session->cleanup_stage = stage;
                session->stop_pending = err != ESP_OK || ap.owned || lease.acquired;
            } else if (err == ESP_OK) session->open_complete = true;
            else session_fault(session, err, stage);
            session->next_service_us = esp_timer_get_time() + (err == ESP_OK ? 0 : 100000);
            session->worker_busy = false;
            xSemaphoreGive(session->mutex);
            handled = true;
        }
        esp32_mquickjs_wifi_raw_tx_session_release(session); /* snapshot reference */
    }
    return handled;
}

bool esp32_mquickjs_wifi_raw_tx_sessions_service(void)
{
    session_t *sessions[ESP32_MQUICKJS_WIFI_RAW_TX_MAX_SESSIONS];
    size_t count = sessions_snapshot(sessions);
    int64_t now = esp_timer_get_time();
    bool handled = false;
    for (size_t i = 0; i < count; ++i) {
        session_t *session = sessions[i];
        bool accepted = false, worker_ref = false;
        if (xSemaphoreTake(session->mutex, 0) == pdTRUE) {
            bool closing = atomic_load_explicit(&session->close_requested, memory_order_acquire);
            bool work = !session->open_complete || session->queue.queued != 0U || session->ticket.sequence != 0U ||
                (session->lane.identity != 0U && (!session->options.rate_set || !session->lane_acquired)) || closing;
            bool submit = work && !session->worker_busy && now >= session->next_service_us &&
                !atomic_load_explicit(&session->closed, memory_order_acquire);
            if (submit && !closing && session->lane.identity != 0U && !session->lane_acquired) {
                session->lane_acquired = esp32_mquickjs_wifi_raw_tx_lane_acquire(&session->lane);
                submit = session->lane_acquired;
            }
            if (submit && !closing && session->native_token.identity != 0U) {
                esp32_mquickjs_wifi_raw_tx_broker_status_t native;
                esp32_mquickjs_wifi_raw_tx_broker_status(&native);
                if (native.token.identity == session->native_token.identity &&
                    native.token.generation == session->native_token.generation &&
                    native.token.radio_lease_identity == session->native_token.radio_lease_identity &&
                    !native.driver_completed && !native.correlation_fault && !native.native_terminated) submit = false;
            }
            if (submit && !closing && !session->open_complete && session->lane_acquired &&
                session->options.rate_set && session->options.interface == ESP32_MQUICKJS_WIFI_RAW_TX_ACCESS_POINT)
                submit = false; /* Runtime service owns AP startup. */
            if (submit && closing && session->ap.owned && session->queue.closed &&
                session->native_token.identity == 0U && session->ticket.sequence == 0U &&
                (!session->ap_physical_terminated || !session->lease.acquired))
                submit = false; /* Do not starve runtime helper retirement with empty workers. */
            if (submit) {
                worker_ref = esp32_mquickjs_wifi_raw_tx_session_retain(session);
                session->worker_busy = worker_ref;
                /* Queue admission is nonblocking; a started worker waits for
                 * this task mutex. On rejection restore the scheduling flag
                 * before unlocking, without another blocking mutex acquire. */
                if (worker_ref) accepted = esp32_mquickjs_submit_background_worker(session_worker, session);
                if (!accepted) { session->worker_busy = false; session->next_service_us = now + 1000; }
            }
            xSemaphoreGive(session->mutex);
        }
        if (accepted) handled = true;
        else if (worker_ref) esp32_mquickjs_wifi_raw_tx_session_release(session);
        /* Keep our snapshot ref through xSemaphoreGive's return even if the
         * newly unblocked worker completes close and drops all its references. */
        esp32_mquickjs_wifi_raw_tx_session_release(session);
    }
    return handled;
}
#endif
